### DataFrame간 산술연산

* 산술연산 method

> add

> sub

> div

> mul

In [4]:
import pandas as pd
import numpy as np

### DataFrame과 Series 간의 연산

In [5]:
arr =np.arange(12.).reshape((3,4))

arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [6]:
arr[0]

array([0., 1., 2., 3.])

In [8]:
#  브로드캐스팅?

arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [50]:
# list(bed) => ['b','e','d']

frame = pd.DataFrame(np.arange(12.).reshape((4,3)), columns=list('bde'),index=['Utah','Ohoi','Texas','Oregon'])

frame

          b     d     e
Utah    0.0   1.0   2.0
Ohoi    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [26]:
series = frame.iloc[0]
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

* DataFrame과 Series간의 산술연산은 Series의 색인을 DataFrame의 column에 맞추고 아래 row로 전파한다

In [27]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohoi    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [37]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohoi    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

* 만약, 색인 값을 DataFrame의 column이나 Series의 색인에서 찾을 수 없다면 그 객체는 형식을 맞추기 위해 <b>재색인 된다</b>
* 양쪽에 겹치는 부분만 연산, 겹치지 않는 부분은 nan

In [33]:
series2 = pd.Series(range(3),index=['b','e','f'])
series2
# df_new = frame + series2 # 기존 frame과 연산한 series2
# df_new

b    0
e    1
f    2
dtype: int64

In [36]:
df_new = frame + series2 # 기존 frame과 연산한 series2
df_new

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohoi    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [53]:
series3 = frame['b']

frame.sub(series3,axis=0) # axis=0  => row에 대해 연산 실행
#  series3의 각 값을 각 column별 row별로 전부 계산함
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohoi    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [52]:
series3 = frame['b']

frame.add(series3,axis=0) # axis=0  => row에 대해 연산 실행
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohoi    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0